* EMACS
** TIPS
*** MODOS
**** DIRED
Gestor de archivos
**** IBUFFER
Con d eliges los buffers que quieres matar y con x los ejecutas 
**** OCCUR
con occur meter una palabra y te aparecen todas las ocurrencias en otro buffer
**** IELM
Puedes probar las expresiones de elisp
*** SECCIONES
**** MOVERSE
- C-c C-n Siguiente sección.
- C-c C-p Sección anterior.
- C-c C-f Siguiente sección del mismo nivel.
- C-c C-b Sección anterior del mismo nivel.
- C-c C-u Ir subiendo a secciones superiores.
**** INSERTAR/MODIFICAR
- M-<RET> Insertar una nueva sección, del mismo nivel que el actual. Si el cursor está a mitad del párrafo, divide el párrafo en dos secciones.
- M-S-<RET> Inserta un elemento TODO en el mismo nivel.
- <TAB> En una sección vacía, ciclar sobre los niveles.
- M-<left>/<right> Incrementar/decrementar un nivel.
- M-S-<left>/<right> Incrementar/decrementar un nivel el sub-árbol actual.
- M-S-<up>/<down> Mover el sub-árbol arriba o abajo.
- C-c C-w Mover la sección o región a otro lugar.
- C-x n s/w Reducir/ampliar el bufer al sub-árbol actual.
*** LISTAS
- No ordenadas: -, + o *.
- Ordenadas: 1. o 1)
- Descripción: Usa :: para separar el término de la descripción.
- <TAB> Ocultar los elementos.
- M-<RET> Insertar nuevo elemento al mismo nivel.
- M-S-<RET> Insertar elemento con checkbox.
- M-S-<up>/<down> Mover elementos arriba/abajo, incluyendo sub elementos.
- M-<left>/M-<right> Incrementar/decrementar nivel.
- M-S-<left>/<right> Incrementar/decrementar nivel incluyendo sub elementos.
- C-c C-c Si hay un checkbox, cambiar el estado.
- C-c - Ciclar sobre los distintos tipos de listas.
*** ENLACES
Sintáxis: "["[enlace][descripcion]"]" o solo "["[enlace]"]", una vez creado, se puede editar con C-c C-l.

Si no hay una URL, el enlace se considera interno al documento:

"["[#custom-id]"]"
"["[My Target][Find my target]"]"
El último ejemplo, busca en el documento actual <<My Target>> y enlaza a él.

Tambien se puede poner lo mismo para los imagenes o cualquier archivo del ordenador
con la ruta del archivo

- C-c l Almacena un enlace a la posición actual.
- C-c C-l Inserta el enlace, pregunta por la url y descipción, si se llama con el prefijo C-u, se usa autocompletado.
- C-c C-l Con el cursor en un enlace, lo edita.
- C-c C-o o mouse-1 o mouse-2 abre el enlace.
*** ITEMS
Toda sección comenzando con TODO es un elemento TODO (lista de tareas).

- C-c C-t Cicla entre los distintos estados (unmarked) -> TODO -> DONE -> (unmarked).
- S-<right>/<left> Igual que arriba, pero solo para el elemento actual.
- C-c / t Ver la lista como un árbol disperso.
- C-c a t Muestra la lista de tareas global.
- S-M-<RET> Inserta una nueva tarea.
- C-c , Establecer prioridad de la tarea (Entre A,B,C).
- S-<up>/<dwn> Ciclar entre prioridades.
*** TABLAS
**** TIPO HOJAS DE CALCULO
- $1+$2;%.2f : suma los dos primeros campos usando 2 decimales
- $0;%.1f : reformatea la celda actual a un decimal
- vmean($2..$7) : computa un rango de columnas, usando un vector de funciones
- vmean($2..$7);EN : igual, pero usa los campos vacios como 0
- C-c } : Muestra las coordenadas del grid de la tabla.
- C-c C-c ó C-x C-s : Sale del editor de formulas
- C-c ‘ : Edita todas las formulas de la tabla actual en un buffer especial.
- C-c ? : Resalta el campo referenciado por la posicion del cursor en una formula.
- C-u C-c * ó C-u C-c C-c : recalcula la tabla entera
[[https://www.blackhats.es/wordpress/?p=84][mas ejemplos]]
*** CHECKBOXES
Se pueden crear listas de tareas compuestas de varios elementos,
y con C-c C-c se marcan como completadas,
para crear una tarea nueva M-S-<RET>.
**** DONE Organize party [2/2]
  - [X] call people [2/2]
    - [X] Peter
    - [X] Sarah
  - [X] order food
*** MARCAS
*negrita* => negrita.
/Cursiva/ => Cursiva.
=code= y ~verbatim~ -> code, verbatim.
+ tachar + (sin espacios) -> tachar.
_subrayar_
*** MACROS
- `C-x (’ or <f3>– start defining a keyboard macro
- `C-x )’ or <f4>– stop defining the keyboard macro
- ‘C-x e’ or <f4> – execute the keyboard macro
- ‘C-u 37 C-x e’ 37 - seria la cantidad de veces que se ejecutaria
-M-37 F4 o M-37 C-x e - Esto nos haria los mismo que lo de arriba
** ELISP
** PAGINAS
[[http://www.blackhats.es][blackharts]]
[[https://lapipaplena.wordpress.com/][la pipa plena curso elisp y emacs]]
[[https://notxor.nueva-actitud.org/][Notxor Articulos interesantes]]
[[https://orgmode.org/worg/org-tutorials/org-spreadsheet-lisp-formulas.html][explica como hacer las sumas del modo lisp para las tablas]](+ 5 3)
* FOL
** NOMINAS
*** DONE EJERCICIO 1

Confeccione la nómina del mes de abril de 2019, de un trabajador que lleva ->
- en la empresa desde 2002:
  - Salario base = 1600€
  - Antiguedad = 20€ por trienio
  - Plus de peligrosidad = 80€
  - Horas extra fuerza mayor = 70€
  - Horas extra normales = 20€
  - Plus de convenio = 90€
  - Cobra 2 pagas extra de salario base mas antiguedad



|------------------------------------------+------------------+--------|
| <c40>                                    |                  |        |
| empresa                                  | TRABAJADOR       |        |
| DOMICILIO                                | NIF              | Nº S.S |
| CIF                                      | CATEGORIA        |        |
| CCC                                      | GRUPO COTIZACION |        |
|------------------------------------------+------------------+--------|

|------------------------------------------+--------------------+------------+--------------------|
| Periodo liquidación                      |                    |            |            Nº dias |
| I.DEVENGOS                               |                    |            |            TOTALES |
| <40>                                     |                    |            |                    |
| 1. Percepciones salariales               |                    |            |                    |
| salario base                             |                    |            |               1600 |
|------------------------------------------+--------------------+------------+--------------------|
| Complementos salariales:                 |                    |            |                    |
| Antigüedad                               |                    |            |                100 |
| Peligrosidad                             |                    |            |                 80 |
| Convenio                                 |                    |            |                 90 |
|------------------------------------------+--------------------+------------+--------------------|
| Horas extraordinarias                    |                    |            |                 90 |
| 2. Percepciones no salariales            |                    |            |                    |
|                                          |                    |            |                    |
| A. TOTAL DEVENGADO                       |                    |            |               1960 |
|------------------------------------------+--------------------+------------+--------------------|
|------------------------------------------+--------------------+------------+--------------------|
| II. DEDUCCIONES                          |                    |            |                    |
|------------------------------------------+--------------------+------------+--------------------|
| 1. Aportaciones del trabajador a las cotizaciones a la S.S y recaudación conjunta |                    | porcentaje |                    |
|                                          |                    |            |                    |
| Contingencias comunes                    | 2153.3333333333335 |        4.7 | 101.20666666666668 |
| Desempleo                                | 2243.3333333333335 |       1.55 |  34.77166666666667 |
| Formación Profesional                    | 2243.3333333333335 |        0.1 | 2.2433333333333336 |
| Horas extraordinarias Normales           |                 20 |        4.7 |               0.94 |
| Horas extraordinarias de Fuerza Mayor    |                 70 |          2 | 1.4000000000000001 |
| TOTAL APORTACIONES                       |                    |            |                    |
|------------------------------------------+--------------------+------------+--------------------|
|                                          |                    |            |                    |
| 2. IRPF                                  |               1960 |         15 |              294.0 |
|                                          |                    |            |                    |
| B. TOTAL A DEDUCIR                       |                    |            |  434.5616666666667 |
| LIQUIDO TOTAL A PERCIBIR(A-B)            |                    |            | 1525.4383333333333 |
|------------------------------------------+--------------------+------------+--------------------|
|                                          |                    |            |                    |
|                                          |                    |            |                    |
|                                          |                    |            |                    |
|                                          |                    |            |                    |
|------------------------------------------+--------------------+------------+--------------------|
| DETERMINACION DE LAS BASES DE COTIZACION A LA SEGURIDAD SOCIAL E IRPF |                    |            |                    |
| 1. Base de cotización por contingencias comunes |                    |            |                    |
| Remuneración mensual                     |                    |            | 1870.3332999999998 |
| Prorrata pagas extras                    |                    |            |                283 |
| TOTAL                                    |                    |            |          2153.3333 |
| 2. Base de cotización por contingencias profesionales y recaudación conjunta |                    |            |          34.771667 |
| 3. Aportación de le empresa:             |                    | porcentaje |                    |
| Por contingencias comunes                |           2153.33€ |       23.6 |        508.1866588 |
| Desempleo                                |          2243.3333 |        5.5 | 123.38333149999998 |
| Fogasa                                   |          2243.3333 |        0.2 | 4.4866665999999995 |
| Formación profesional                    |          2243.3333 |        0.6 | 13.459999799999999 |
|                                          |                    |            |                0.0 |
| 4. Base de contización por horas extras normales |                 20 |       23.6 |  4.720000000000001 |
| 5. Base de cotización por horas extras fuerza mayor |                 70 |         12 |                8.4 |
| 6. Base sujeta a retención del IRPF      |                    |            |                    |
|------------------------------------------+--------------------+------------+--------------------|
#+TBLFM: @13$4='(+ @5$4..@11$4);N::@17$2='(- (+ @13$4 (/ (* (+ @5$4 @7$4) 2) 12.0)) @10$4);N::@17$4..@21$4='(* $2 (/ $3 100.0));N::@18$2='(+ @17$2 @10$4);N::@19$2='(+ @17$2 @10$4);N::@24$2=@13$4::@26$4='(+ @-10$4..@-1$4);N::@27$4='(- @13$4 @26$4);N::@34$4='(- @36$4 @35$4);N::@35$4='(/ (* (+ @5$4 @7$4) 2) 12);N::@36$4=@17$2::@37$4=@18$4::@39$2=@17$2::@39$4..@45$4='(* $2 (/ $3 100.0));N::@40$2..@42$2=@18$2
#+TBLFM: @39$2 = @39$2;%.2f€ 
vsum(@5$4..@11$4);%.2f€
*** TODO EJERCICIO 2
Confecciones la nómina del mes de abril de 2019, de un trabajador un contrato ->
- temporal pertenece al grupo 1 de contización:
  - Residencia: Donostia y 2 hijos.
  - Salario base = 2500€
  - Antiguedad = 100€
  - Plus de resposabilidad = 90€
  - Plus de ropa de trabajo = 60€
  - Las horas extra normales = 70€
  - Las pagas extra de salario base las cobra prorrateadas.
*** DONE EJERCICIO 3 
Confeccionar la nómina de mayo de 2019, grupo de cotización 1, ->
- contrato de interinidad, en la empresa desde el año 2000.
  - 1 hijo.
  - Salario base = 2800€
  - Antigüedad = 2% del salario base por trienio.
  - Plus quebranto de moneda = 60€
  - Hora extras estructurales = 40€
  - Plus de nocturnidad = 50€
  - Cobra 2 pagas extras de salario base mas antigüedad.

|------------------------------------------+------------------+--------|
| <c40>                                    |                  |        |
| empresa                                  | TRABAJADOR       |        |
| DOMICILIO                                | NIF              | Nº S.S |
| CIF                                      | CATEGORIA        |        |
| CCC                                      | GRUPO COTIZACION |        |
|------------------------------------------+------------------+--------|

|------------------------------------------+-----------+------------+-----------|
| Periodo liquidación                      |           |            |   Nº dias |
| I.DEVENGOS                               |           |            |   TOTALES |
| <40>                                     |           |            |           |
| 1. Percepciones salariales               |           |            |           |
| salario base                             |           |            |      2800 |
|------------------------------------------+-----------+------------+-----------|
| Complementos salariales:                 |           |            |           |
| Antigüedad                               |           |            |      336. |
| Plus de nocturnidad                      |           |            |        50 |
|                                          |           |            |           |
|------------------------------------------+-----------+------------+-----------|
| Horas extraordinarias                    |           |            |        40 |
| 2. Percepciones no salariales            |           |            |           |
| Plus quebranto de moneda                 |           |            |        60 |
| A. TOTAL DEVENGADO                       |           |            |     3286. |
|------------------------------------------+-----------+------------+-----------|
|------------------------------------------+-----------+------------+-----------|
| II. DEDUCCIONES                          |           |            |           |
|------------------------------------------+-----------+------------+-----------|
| 1. Aportaciones del trabajador a las cotizaciones a la S.S y recaudación conjunta |           | porcentaje |           |
|                                          |           |            |           |
| Contingencias comunes                    | 3768.6667 |       4.7% | 177.12733 |
| Desempleo                                | 3808.6667 |      1.55% | 59.034334 |
| Formación Profesional                    | 3808.6667 |       0.1% | 3.8086667 |
| Horas extraordinarias Normales           |        40 |       4.7% |      1.88 |
| TOTAL APORTACIONES                       |           |            |           |
|------------------------------------------+-----------+------------+-----------|
|                                          |           |            |           |
| 2. IRPF                                  |     3286. |        19% |    624.34 |
|                                          |           |            |           |
| B. TOTAL A DEDUCIR                       |           |            | 8.6619033 |
| LIQUIDO TOTAL A PERCIBIR(A-B)            |           |            | 3277.3381 |
|------------------------------------------+-----------+------------+-----------|
|                                          |           |            |           |
|                                          |           |            |           |
|                                          |           |            |           |
|                                          |           |            |           |
|------------------------------------------+-----------+------------+-----------|
| DETERMINACION DE LAS BASES DE COTIZACION A LA SEGURIDAD SOCIAL E IRPF |           |            |           |
| 1. Base de cotización por contingencias comunes |           |            |           |
| Remuneración mensual                     |           |            | 3246.0000 |
| Prorrata pagas extras                    |           |            | 522.66667 |
| TOTAL                                    |           |            | 3768.6667 |
| 2. Base de cotización por contingencias profesionales y recaudación conjunta |           |            | 3808.6667 |
| 3. Aportación de le empresa:             |           | porcentaje |           |
| Por contingencias comunes                | 3768.6667 |      23.6% | 889.40534 |
| Desempleo                                | 3808.6667 |       5.5% | 209.47667 |
| Fogasa                                   | 3808.6667 |       0.2% | 7.6173334 |
| Formación profesional                    | 3808.6667 |       0.6% | 22.852000 |
|                                          |           |            |           |
| 4. Base de contización por horas extras normales |        40 |      23.6% |      9.44 |
| 5. Base de cotización por horas extras fuerza mayor |           |        12% |           |
| 6. Base sujeta a retención del IRPF      |           |            |           |
|------------------------------------------+-----------+------------+-----------|
#+TBLFM: @7$4=6*2800*0.02::@13$4=vsum(@4$4..@12$4)::@17$2=@13$4+@34$4-@10$4::@18$2..@19$2=@13$4+@34$4::@20$2=@10$4::@23$2=@13$4::@25$4=vsum(@17$4..@23$4)::@26$4=@13$4-@25$4::@33$4=@17$2 - @34$4::@34$4=(@5$4+@7$4)*2/12::@35$4=@17$2::@36$4=@18$2::@38$2=@-3$4::@39$2..@41$2=@36$4::@43$2=@10$4
#+TBLFM: @17$4..@20$4=$2 * ($3/100)::@23$4=$2 * ($3/100)::@38$4..@41$4=$2 * ($3/100)::@43$4=$2 * ($3/100)
#+TBLFM: @43$3..@44$3 = '(concat $3 "%")::@38$3..@41$3 = '(concat $3 "%")::@17$3..@20$3 = '(concat $3 "%")::@23$3 = '(concat $3 "%")


@7$4 = 6*2800*0.02
@13$4 = vsum(@4$4..@12$4)
@34$4 = (@5$4+@7$4)*2/12
@17$2 = @13$4+@34$4-@10$4
@18$2..@19$2 = @13$4+@34$4
@20$2 = @10$4
@17$4..@20$4 = $2 * ($3/100)
@23$2 = @13$4
@23$4 = $2 * ($3/100)
@25$4 = vsum(@17$4..@23$4)
@26$4 = @13$4-@25$4
@35$4 = @17$2
@33$4 = @17$2 - @34$4
@36$4 = @18$2
@38$2 = @13$4+@34$4-@10$4
@39$2..@41$2 = @18$2
@38$4..@41$4 = $2 * ($3/100)
@43$4 = $2 * ($3/100)

** FINIQUITOS
*** TODO 
*** TODO 
*** TODO 
*** TODO 
*** TODO 
*** TODO 
*** TODO 
*** TODO 
* PROGRAMACION
** ESQUEMA
- Objetos:
| menu | propiedades | metodos   |
|      |             | mostrar() |
|      |             |           |

| conversor |
|           |

| restaurantes |
|              |

| curiosidades |
|              |

| ciudades |
|          |
